#+TITLE: Field Notes
#+STARTUP: logdone
#+TODO: TODO IN-PROGRESS(!) | DONE(!)


*** TODO Learn You A Haskell
    
    http://learnyouahaskell.com/chapters   


    #+begin_src haskell :exports both
      doubleMe x = x + x
      doubleMe 2
    #+end_src

    #+RESULTS:
    : 4

    #+begin_src haskell :exports both
      head' :: [a] -> a
      head' [] = error "Can't call head on an empty list, dummy!"
      head' (x:_) = x

     head' [8,1,2,3]
      
    #+end_src

    #+RESULTS:
    : 8


    #+begin_src haskell :exports both
      someSum :: (Num a) => [a] -> a
      someSum [] = 0
      someSum (x:xs) = x + someSum xs
      someSum [1,2]
    #+end_src

    #+RESULTS:
    : *** Exception: <interactive>:45:1-31: Non-exhaustive patterns in function someSum


    - [X] Chapter 1
    - [X] Chapter 2
    - [X] Chapter 3
    - [ ] Chapter 4
    - [ ] Chapter 5
    - [ ] Chapter 6
    - [ ] Chapter 7
    - [ ] Chapter 8
    - [ ] Chapter 9
    - [ ] Chapter 10
    - [ ] Chapter 11
    - [ ] Chapter 12
    - [ ] Chapter 13
    - [ ] Chapter 14

**** Closure
     
     #+begin_quote
     A /closure/ is the combination of a function and the lexical environment within which that function was declared.
     
     -- https://developer.mozilla.org/en-US/docs/Web/JavaScript/Closures
     #+end_quote

     In other words, a /closure/ is a function that is created in the body of another function, which has access to the outer function's scope. 

     _Why?_ It is JavaScript's way of avoiding global scope, aka Encapsulation.

     #+begin_src js
       function init() {
           var name = 'George Washington';
           function displayName() { // <-- This is a closure
               console.log(name);   // <-- Has access to the name var outside of its scope
           }
           displayName();
       }

       init();
     #+end_src

     #+RESULTS:
     : George Washington
     : undefined

    
